import React from 'react';

const About = () => {
  return (
    <div className="min-h-screen bg-[#f7f2e7] flex flex-col items-center justify-center p-6">
      <h1 className="text-4xl font-bold mb-6 text-[#9B111E]">TRIPLY</h1>
      <div className="max-w-4xl text-lg leading-relaxed text-[#9B111E]  p-6 rounded-lg shadow-lg">
        <p className="mb-4">
          טיולים משפחתיים הם דרך נהדרת ליצור זיכרונות משותפים ולחוות חוויות יחד. עם זאת, ארגון טיול משפחתי יכול
          להפוך למשימה מורכבת ומאתגרת, הכוללת קביעת תאריכים, יצירת מסלולים, תיאום פעילויות, וניהול תקציב. כל אחד מהמשתתפים
          בטיול מעורב בתהליך בצורה שונה, ולפעמים נוצר קושי בתיאום, במיוחד כשישנם מגוון העדפות, לוחות זמנים ודרישות שונות.
        </p>
        <p className="mb-4">
          המטרה של פרויקט זה היא לפתח מערכת שתפשט את תהליך הארגון של טיולים משפחתיים, תסייע במניעת חיכוכים ולייעל את שיתוף
          הפעולה בין בני המשפחה. המערכת תספק פלטפורמה אינטראקטיבית שבה כל אחד מהמשתתפים יוכל לקחת אחריות על חלק מהמשימות,
          לבצע החלטות דמוקרטיות בעזרת סקרים ולהתעדכן באופן שוטף על מצב הביצוע של המשימות השונות.
        </p>
        <p className="mb-4">
          באמצעות המערכת, יוכל כל בן משפחה לתכנן ולארגן את הטיול בקלות וביעילות, תוך שמירה על סדר, חלוקה שווה של
          האחריות והוצאות, ושיפור חוויית התכנון לכל המשתתפים. המערכת תאפשר שיתוף פעולה משופר, תספק אפשרויות לביצוע
          החלטות משותפות ותסייע בשמירה על ארגון וניהול טיול משפחתי בצורה נוחה ומסודרת.
        </p>
        <p className="mb-4">
          קיימות מספר אפליקציות ושירותים שמציעים פתרונות חלקיים להקל על תכנון טיולים. דוגמאות לכך כוללות את אפליקציות
          כמו Google Trips ו-TripIt, שמתמקדות בהזמנות ובתיאום טכני, אך חסרות את הפוקוס על שיתוף פעולה בין המשתמשים
          וניתוב תקציב בצורה מותאמת אישית.
        </p>
        <p>
          היתרון של המערכת המוצעת בפרויקט זה הוא האינטגרציה המלאה של כל האלמנטים הנדרשים בתהליך הארגון, תוך שמירה
          על פשטות השימוש ויכולת לכל חבר משפחה לקחת חלק פעיל. המערכת תספק לא רק פתרונות לתכנון, אלא גם כלים לניהול
          שוטף של משימות ותקציב, ותסייע בהקפדה על שמירת הזיכרונות הדיגיטליים וההוצאות בזמן אמת.
        </p>
      </div>
    </div>
  );
};
export default About;